---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealError
source: html/0e1d05d2-8532-2f5d-a554-7e08bef0e2fb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealError Property

Could not create Reveal. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateRevealError { get; }
```